naminjuda/rtos-scout-robot/firmware/NUCLEO-F439ZI-uCOSIII/Examples/ST/STM32F429II-SK/OS3/app.c
/*
*********************************************************************************************************
*                                            APPLICATION CORE
*
*                       STM32 NUCLEO-F439ZI + uC/OS-III RTOS application skeleton
*********************************************************************************************************
*/

#include  <includes.h>
#include  "app_core.h"
#include  "app_cfg.h"
#include  "app_io.h"
#include  "stm32f4xx_rcc.h"
#include  "stm32f4xx_gpio.h"
#include  "stm32f4xx.h"
#include  "button.h"

/*
*********************************************************************************************************
*                                         FUNCTION PROTOTYPES
*********************************************************************************************************
*/

static  void  AppTaskStart       (void  *p_arg);
static  void  AppTaskCreate      (void);
static  void  AppObjCreate       (void);

static  void  EmergencyTask      (void  *p_arg);
static  void  CommandTask        (void  *p_arg);
static  void  SensorTask         (void  *p_arg);
static  void  ControlTask        (void  *p_arg);
static  void  OutputLogTask      (void  *p_arg);

static  void  Setup_Gpio         (void);
static  void  App_HardwareStopAll(void);

static  void  Sensor_PostObstacleEvent(void);
static  void  Joystick_PostManualCommand(void);

static  void       Command_HandleLine        (char *line);
static  EventType  Command_Parse             (const char *line);
static  void       Command_PrintStatus       (void);
static  void       Command_ApplyManualOutput (EventType type);
static  void       Command_NormalizeLine     (char *line);
static  const char *State_ToString           (SystemState state);
static  const char *Event_ToString           (EventType type);
static  void       Output_ApplyState         (SystemState state);

/*
*********************************************************************************************************
*                                       LOCAL GLOBAL VARIABLES
*********************************************************************************************************
*/

static  OS_TCB   AppTaskStartTCB;
static  CPU_STK  AppTaskStartStk[APP_CFG_TASK_START_STK_SIZE];

static  OS_TCB   EmergencyTaskTCB;
static  OS_TCB   CommandTaskTCB;
static  OS_TCB   SensorTaskTCB;
static  OS_TCB   ControlTaskTCB;
static  OS_TCB   OutputLogTaskTCB;

static  CPU_STK  EmergencyTaskStk[APP_CFG_TASK_STK_SIZE];
static  CPU_STK  CommandTaskStk[APP_CFG_TASK_STK_SIZE];
static  CPU_STK  SensorTaskStk[APP_CFG_TASK_STK_SIZE];
static  CPU_STK  ControlTaskStk[APP_CFG_TASK_STK_SIZE];
static  CPU_STK  OutputLogTaskStk[APP_CFG_TASK_STK_SIZE];

typedef  struct  app_task_cfg {
    CPU_CHAR    *Name;
    OS_TASK_PTR  Task;
    OS_PRIO      Prio;
    CPU_STK     *Stk;
    OS_TCB      *TCB;
} APP_TASK_CFG;

static  const  APP_TASK_CFG  AppTaskTbl[] = {
    { (CPU_CHAR *)"EmergencyTask", EmergencyTask, APP_CFG_TASK_EMERGENCY_PRIO, &EmergencyTaskStk[0], &EmergencyTaskTCB },
    { (CPU_CHAR *)"ControlTask",   ControlTask,   APP_CFG_TASK_CONTROL_PRIO,   &ControlTaskStk[0],   &ControlTaskTCB   },
    { (CPU_CHAR *)"CommandTask",   CommandTask,   APP_CFG_TASK_COMMAND_PRIO,   &CommandTaskStk[0],   &CommandTaskTCB   },
    { (CPU_CHAR *)"SensorTask",    SensorTask,    APP_CFG_TASK_SENSOR_PRIO,    &SensorTaskStk[0],    &SensorTaskTCB    },
    { (CPU_CHAR *)"OutputLogTask", OutputLogTask, APP_CFG_TASK_OUTPUT_PRIO,    &OutputLogTaskStk[0], &OutputLogTaskTCB }
};

#define  APP_TASK_TBL_SIZE  (sizeof(AppTaskTbl) / sizeof(AppTaskTbl[0]))

static  volatile  int       g_last_distance_cm = -1;
static  volatile  int       g_last_ir_obstacle = 0;
static  volatile  uint16_t  g_last_joy_x = 0u;
static  volatile  uint16_t  g_last_joy_y = 0u;
static  CPU_INT08U  g_forward_display_ticks = 0u;

/*
*********************************************************************************************************
*                                                main()
*********************************************************************************************************
*/

int  main (void)
{
    OS_ERR  err;

    RCC_DeInit();
    Setup_Gpio();

    BSP_IntDisAll();

    CPU_Init();
    Mem_Init();
    Math_Init();

    OSInit(&err);

    OSTaskCreate((OS_TCB       *)&AppTaskStartTCB,
                 (CPU_CHAR     *)"App Task Start",
                 (OS_TASK_PTR   )AppTaskStart,
                 (void         *)0u,
                 (OS_PRIO       )APP_CFG_TASK_START_PRIO,
                 (CPU_STK      *)&AppTaskStartStk[0u],
                 (CPU_STK_SIZE  )APP_CFG_TASK_START_STK_SIZE_LIMIT,
                 (CPU_STK_SIZE  )APP_CFG_TASK_START_STK_SIZE,
                 (OS_MSG_QTY    )0u,
                 (OS_TICK       )0u,
                 (void         *)0u,
                 (OS_OPT        )(OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR),
                 (OS_ERR       *)&err);

    OSStart(&err);

    (void)&err;
    return (0u);
}

/*
*********************************************************************************************************
*                                          STARTUP TASK
*********************************************************************************************************
*/

static  void  AppTaskStart (void *p_arg)
{
    OS_ERR  err;

    (void)p_arg;

    BSP_Init();
    BSP_Tick_Init();

#if OS_CFG_STAT_TASK_EN > 0u
    OSStatTaskCPUUsageInit(&err);
#endif

#ifdef CPU_CFG_INT_DIS_MEAS_EN
    CPU_IntDisMeasMaxCurReset();
#endif

    AppIO_Init();

    AppObjCreate();
    AppTaskCreate();

    while (DEF_TRUE) {
        OSTimeDlyHMSM(0u, 0u, 1u, 0u, OS_OPT_TIME_HMSM_STRICT, &err);
    }
}

/*
*********************************************************************************************************
*                                          APPLICATION TASKS
*********************************************************************************************************
*/

static  void  EmergencyTask (void *p_arg)
{
    OS_ERR  err;

    (void)p_arg;

    while (DEF_TRUE) {
        OSSemPend(App_GetEmergencySem(),
                  0u,
                  OS_OPT_PEND_BLOCKING,
                  (CPU_TS *)0,
                  &err);

        if (err == OS_ERR_NONE) {
            App_HardwareStopAll();
            (void)App_PostEvent(EVT_EMERGENCY_STOP, APP_EVENT_SRC_EMERGENCY, 0u);
        }
    }
}

static  void  ControlTask (void *p_arg)
{
    AppEvent  event;
    OS_ERR    err;

    (void)p_arg;

    while (DEF_TRUE) {
        App_WaitEvent(&event, &err);

        if (err == OS_ERR_NONE) {
            App_HandleEvent(&event);

