naminjuda/rtos-scout-robot/firmware/NUCLEO-F439ZI-uCOSIII/Examples/ST/STM32F429II-SK/OS3/app.c
            /*
             * Apply command output here so USART, joystick, and button events
             * use the same output path.
             */
            switch (event.Type) {
                case EVT_CMD_LEFT:
                case EVT_CMD_RIGHT:
                case EVT_CMD_CENTER:
                case EVT_CMD_FORWARD:
                case EVT_CMD_STOP:
                case EVT_CMD_RESET:
                    Command_ApplyManualOutput(event.Type);
                    break;

                default:
                    break;
            }
        }
    }
}

static  void  CommandTask (void *p_arg)
{
    OS_ERR      err;
    char        ch;
    static char line[32];
    static int  len = 0;

    (void)p_arg;

    Log_Print("[TASK] CommandTask started\r\n");
    Log_Print("[HELP] AUTO MANUAL FORWARD LEFT RIGHT CENTER STOP STATUS CANCEL RESET\r\n");

    while (DEF_TRUE) {
        while (USART3_ReadCharNonBlocking(&ch) != 0) {
            if ((ch == '\r') || (ch == '\n')) {
                if (len > 0) {
                    line[len] = '\0';
                    Command_HandleLine(line);
                    len = 0;
                }
            } else if ((ch == 8) || (ch == 127)) {
                if (len > 0) {
                    len--;
                }
            } else {
                if (len < ((int)sizeof(line) - 1)) {
                    line[len++] = ch;
                } else {
                    len = 0;
                    Log_Print("[CMD] input too long. cleared\r\n");
                }
            }
        }

        OSTimeDlyHMSM(0u, 0u, 0u, 20u, OS_OPT_TIME_HMSM_STRICT, &err);
    }
}
static  void  SensorTask (void *p_arg)
{
    OS_ERR  err;

    (void)p_arg;

    Log_Print("[TASK] SensorTask started\r\n");

    while (DEF_TRUE) {
        /*
         * TODO(developer sensor): Read distance/IR sensors and post sensor events.
         * Example: App_PostEvent(EVT_SENSOR_OBSTACLE_WARN, APP_EVENT_SRC_SENSOR, value);
         */
    	Sensor_PostObstacleEvent();
    	Joystick_PostManualCommand();
        OSTimeDlyHMSM(0u, 0u, 0u, 100u, OS_OPT_TIME_HMSM_STRICT, &err);
    }
}

static  void  OutputLogTask (void *p_arg)
{
    OS_ERR       err;
    SystemState  state;
    SystemState  last_state;

    (void)p_arg;

    last_state = STATE_COUNT;
    Log_Print("[TASK] OutputLogTask started\r\n");

    while (DEF_TRUE) {
        state = App_GetState();

        Output_ApplyState(state);

        if (state != last_state) {
            Log_Print("[STATE] ");
            Log_Print(State_ToString(last_state));
            Log_Print(" -> ");
            Log_Print(State_ToString(state));
            Log_Print("\r\n");
            last_state = state;
        }

        OSTimeDlyHMSM(0u, 0u, 0u, 100u, OS_OPT_TIME_HMSM_STRICT, &err);
    }
}

/*
*********************************************************************************************************
*                                          AppTaskCreate()
*********************************************************************************************************
*/

static  void  AppTaskCreate (void)
{
    OS_ERR      err;
    CPU_INT08U  i;

    for (i = 0u; i < APP_TASK_TBL_SIZE; i++) {
        OSTaskCreate((OS_TCB       *)AppTaskTbl[i].TCB,
                     (CPU_CHAR     *)AppTaskTbl[i].Name,
                     (OS_TASK_PTR   )AppTaskTbl[i].Task,
                     (void         *)0u,
                     (OS_PRIO       )AppTaskTbl[i].Prio,
                     (CPU_STK      *)AppTaskTbl[i].Stk,
                     (CPU_STK_SIZE  )APP_CFG_TASK_STK_SIZE_LIMIT,
                     (CPU_STK_SIZE  )APP_CFG_TASK_STK_SIZE,
                     (OS_MSG_QTY    )0u,
                     (OS_TICK       )0u,
                     (void         *)0u,
                     (OS_OPT        )(OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR),
                     (OS_ERR       *)&err);
    }

    ButtonTaskCreate(&err);

    if (err == OS_ERR_NONE) {
        Log_Print("[TASK] ButtonTask created\r\n");
    } else {
        Log_Print("[TASK] ButtonTask create failed\r\n");
    }
}

/*
*********************************************************************************************************
*                                          AppObjCreate()
*********************************************************************************************************
*/

static  void  AppObjCreate (void)
{
    OS_ERR  err;

    App_CoreInit(&err);
}

/*
*********************************************************************************************************
*                                      COMMAND / OUTPUT HELPERS
*********************************************************************************************************
*/

static  void  Command_NormalizeLine (char *line)
{
    int  r;
    int  w;
    char c;

    r = 0;
    while ((line[r] == ' ') || (line[r] == '\t')) {
        r++;
    }

    w = 0;
    while (line[r] != '\0') {
        c = line[r++];
        if ((c == ' ') || (c == '\t')) {
            continue;
        }
        line[w++] = (char)toupper((int)c);
    }

    line[w] = '\0';
}

static  EventType  Command_Parse (const char *line)
{
    if (strcmp(line, "AUTO") == 0) {
        return EVT_CMD_AUTO;
    }

    if (strcmp(line, "MANUAL") == 0) {
        return EVT_CMD_MANUAL;
    }

    if (strcmp(line, "FORWARD") == 0) {
        return EVT_CMD_FORWARD;
    }

    if (strcmp(line, "LEFT") == 0) {
        return EVT_CMD_LEFT;
    }

    if (strcmp(line, "RIGHT") == 0) {
        return EVT_CMD_RIGHT;
    }

    if (strcmp(line, "CENTER") == 0) {
        return EVT_CMD_CENTER;
    }

    if (strcmp(line, "STOP") == 0) {
        return EVT_CMD_STOP;
    }

    if (strcmp(line, "STATUS") == 0) {
        return EVT_CMD_STATUS;
    }

    if (strcmp(line, "CANCEL") == 0) {
        return EVT_CMD_CANCEL;
    }

    if (strcmp(line, "RESET") == 0) {
        return EVT_CMD_RESET;
    }

    return EVT_TYPE_COUNT;
}

static  void  Command_HandleLine (char *line)
{
    EventType type;

    Command_NormalizeLine(line);

    if (line[0] == '\0') {
        return;
    }

