naminjuda/rtos-scout-robot/firmware/NUCLEO-F439ZI-uCOSIII/Examples/ST/STM32F429II-SK/OS3/app.c
    /*
    * Temporary C-part output test commands.
    * These commands are useful before the real sensor/button/buzzer modules are connected.
    */
    if (strcmp(line, "TESTWARN") == 0) {
        Log_Print("[TEST] Force AUTO_MODE -> OBSTACLE_WARNING\r\n");
        (void)App_PostEvent(EVT_CMD_AUTO, APP_EVENT_SRC_COMMAND, 0u);
        (void)App_PostEvent(EVT_SENSOR_OBSTACLE_WARN, APP_EVENT_SRC_SENSOR, 20u);
        return;
    }

    if (strcmp(line, "TESTCRIT") == 0) {
        Log_Print("[TEST] Force AUTO_MODE -> AUTO_STOP\r\n");
        (void)App_PostEvent(EVT_CMD_AUTO, APP_EVENT_SRC_COMMAND, 0u);
        (void)App_PostEvent(EVT_SENSOR_OBSTACLE_CRITICAL, APP_EVENT_SRC_SENSOR, 8u);
        return;
    }

    if (strcmp(line, "TESTEMG") == 0) {
        Log_Print("[TEST] Force EMERGENCY_STOP\r\n");
        (void)App_PostEvent(EVT_EMERGENCY_STOP, APP_EVENT_SRC_EMERGENCY, 0u);
        return;
    }

    if (strcmp(line, "TESTRECOV") == 0) {
        Log_Print("[TEST] Force RECOVERY_WAIT output\r\n");
        App_SetState(STATE_RECOVERY_WAIT);
        return;
    }

    type = Command_Parse(line);

    if (type == EVT_TYPE_COUNT) {
        Log_Print("[CMD] unknown: ");
        Log_Print(line);
        Log_Print("\r\n");
        Log_Print("[HELP] AUTO MANUAL FORWARD LEFT RIGHT CENTER STOP STATUS CANCEL RESET\r\n");
        return;
    }

    Log_Print("[CMD] ");
    Log_Print(line);
    Log_Print(" received\r\n");

    if (type == EVT_CMD_STATUS) {
        Command_PrintStatus();
    }

    if (type == EVT_CMD_CANCEL) {
        CPU_INT16U flushed;

        flushed = App_FlushPendingEvents();
        g_forward_display_ticks = 0u;

        Servo_SetAngle(SERVO_CENTER_ANGLE);
        Buzzer_SetState(STATE_IDLE);

        Log_PrintNum("[CMD] CANCEL flushed ", flushed, " pending event(s)\r\n");

        if (App_PostEvent(EVT_CMD_CANCEL, APP_EVENT_SRC_COMMAND, 0u) == DEF_OK) {
            Log_Print("[POST] EVT_CMD_CANCEL\r\n");
        } else {
            Log_Print("[POST] EVT_CMD_CANCEL failed\r\n");
        }

        return;
    }
    if (App_PostEvent(type, APP_EVENT_SRC_COMMAND, 0u) == DEF_OK) {
        Log_Print("[POST] ");
        Log_Print(Event_ToString(type));
        Log_Print("\r\n");
    } else {
        Log_Print("[POST] failed\r\n");
    }

}

static  void  Command_ApplyManualOutput (EventType type)
{
    SystemState state;

    state = App_GetState();

    if ((state == STATE_EMERGENCY_STOP) && (type != EVT_CMD_RESET)) {
        Log_Print("[ACT] ignored because state is EMERGENCY_STOP\r\n");
        return;
    }

    switch (type) {
        case EVT_CMD_LEFT:
            Servo_SetAngle(SERVO_LEFT_ANGLE);
            Log_Print("[ACT] Servo angle = LEFT\r\n");
            break;

        case EVT_CMD_RIGHT:
            Servo_SetAngle(SERVO_RIGHT_ANGLE);
            Log_Print("[ACT] Servo angle = RIGHT\r\n");
            break;

        case EVT_CMD_CENTER:
            Servo_SetAngle(SERVO_CENTER_ANGLE);
            Log_Print("[ACT] Servo angle = CENTER\r\n");
            break;

        case EVT_CMD_FORWARD:
            Servo_SetAngle(SERVO_CENTER_ANGLE);
            g_forward_display_ticks = 25u;
            Log_Print("[ACT] Forward display ON: servo center, cyan blink\r\n");
            break;

        case EVT_CMD_STOP:
            g_forward_display_ticks = 0u;
            Servo_SetAngle(SERVO_CENTER_ANGLE);
            Buzzer_SetState(STATE_IDLE);
            Log_Print("[ACT] Stop output / servo center / forward display off\r\n");
            break;

        case EVT_CMD_RESET:
            g_forward_display_ticks = 0u;
            Servo_SetAngle(SERVO_CENTER_ANGLE);
            Buzzer_SetState(STATE_IDLE);
            Log_Print("[ACT] Reset output / servo center / buzzer off\r\n");
            break;

        default:
            break;
    }
}

static  void  Command_PrintStatus (void)
{
    Log_Print("[STATUS] state=");
    Log_Print(State_ToString(App_GetState()));
    Log_Print(", distance=");
    Log_PrintNum("", g_last_distance_cm, "cm, ");
    Log_PrintNum("ir=", g_last_ir_obstacle, ", ");
    Log_PrintNum("joy_x=", g_last_joy_x, ", ");
    Log_PrintNum("joy_y=", g_last_joy_y, "\r\n");
}

static  void  Output_ApplyState (SystemState state)
{
    if ((state == STATE_MANUAL_MODE) && (g_forward_display_ticks > 0u)) {
        RGB_SetForwardState();
        g_forward_display_ticks--;
    } else {
        RGB_SetState(state);
    }

    Buzzer_SetState(state);

    if ((state == STATE_IDLE) ||
        (state == STATE_AUTO_MODE) ||
        (state == STATE_OBSTACLE_WARNING) ||
        (state == STATE_AUTO_STOP) ||
        (state == STATE_EMERGENCY_STOP) ||
        (state == STATE_RECOVERY_WAIT)) {
        Servo_SetAngle(SERVO_CENTER_ANGLE);
    }
}

static  const char *State_ToString (SystemState state)
{
    switch (state) {
        case STATE_IDLE:
            return "IDLE";

        case STATE_MANUAL_MODE:
            return "MANUAL_MODE";

        case STATE_AUTO_MODE:
            return "AUTO_MODE";

        case STATE_OBSTACLE_WARNING:
            return "OBSTACLE_WARNING";

        case STATE_AUTO_STOP:
            return "AUTO_STOP";

        case STATE_EMERGENCY_STOP:
            return "EMERGENCY_STOP";

        case STATE_RECOVERY_WAIT:
            return "RECOVERY_WAIT";

        default:
            return "UNKNOWN";
    }
}

static  const char *Event_ToString (EventType type)
{
    switch (type) {
        case EVT_CMD_AUTO:
            return "EVT_CMD_AUTO";

        case EVT_CMD_MANUAL:
            return "EVT_CMD_MANUAL";

        case EVT_CMD_FORWARD:
            return "EVT_CMD_FORWARD";

        case EVT_CMD_LEFT:
            return "EVT_CMD_LEFT";

        case EVT_CMD_RIGHT:
            return "EVT_CMD_RIGHT";

        case EVT_CMD_CENTER:
            return "EVT_CMD_CENTER";

        case EVT_CMD_STOP:
            return "EVT_CMD_STOP";

        case EVT_CMD_STATUS:
            return "EVT_CMD_STATUS";

        case EVT_CMD_CANCEL:
            return "EVT_CMD_CANCEL";

