naminjuda/rtos-scout-robot/firmware/NUCLEO-F439ZI-uCOSIII/Examples/ST/STM32F429II-SK/OS3/app.c
        case EVT_CMD_RESET:
            return "EVT_CMD_RESET";

        case EVT_SENSOR_CLEAR:
            return "EVT_SENSOR_CLEAR";

        case EVT_SENSOR_OBSTACLE_WARN:
            return "EVT_SENSOR_OBSTACLE_WARN";

        case EVT_SENSOR_OBSTACLE_CRITICAL:
            return "EVT_SENSOR_OBSTACLE_CRITICAL";

        case EVT_IR_OBSTACLE:
            return "EVT_IR_OBSTACLE";

        case EVT_EMERGENCY_STOP:
            return "EVT_EMERGENCY_STOP";

        default:
            return "EVT_UNKNOWN";
    }
}

/*
*********************************************************************************************************
*                                      SENSOR EVENT POST
*********************************************************************************************************
*/
static  void  Sensor_PostObstacleEvent (void)
{
    int             distance;
    int             ir;
    static int      last_ultra_zone = -1;
    static int      last_ir = -1;
    static CPU_INT16U timeout_count = 0u;

    distance = Ultrasonic_ReadDistanceCm();
    ir       = IR_IsObstacleDetected();

    g_last_distance_cm = distance;
    g_last_ir_obstacle = ir;

    /*
     * 1. IR은 초음파와 독립적으로 먼저 처리
     * 초음파가 timeout이어도 IR 감지는 무조건 살아있어야 함
     */
    if (ir != last_ir) {
        Log_PrintNum("[SENSOR] ir=", ir, "\r\n");
        last_ir = ir;
    }

    if (ir == 1) {
        Log_Print("[POST] EVT_IR_OBSTACLE\r\n");

        (void)App_PostEvent(EVT_IR_OBSTACLE,
                             APP_EVENT_SRC_SENSOR,
                             0u);
    }

    /*
     * 2. 초음파 timeout 처리
     * 여기서 return해도 이미 위에서 IR 처리는 끝났음
     */
    if (distance < 0) {
        timeout_count++;

        /*
         * 초음파 timeout은 연결 끊김이 아닐 수도 있으니까
         * 로그가 보기 싫으면 이 부분은 아예 주석 처리해도 됨
         */
        if (timeout_count >= 50u) {
            Log_Print("[SENSOR] ultrasonic timeout. no echo detected.\r\n");
            timeout_count = 0u;
        }

        return;
    }

    timeout_count = 0u;

    /*
     * 3. 초음파 거리 기준 처리
     * zone:
     * 0 = clear
     * 1 = warning
     * 2 = critical
     */
    if (distance <= DIST_CRITICAL_CM) {
        if (last_ultra_zone != 2) {
            Log_PrintNum("[SENSOR] distance=", distance, "cm, ");
            Log_PrintNum("ir=", ir, "\r\n");
            Log_Print("[POST] EVT_SENSOR_OBSTACLE_CRITICAL\r\n");
        }

        (void)App_PostEvent(EVT_SENSOR_OBSTACLE_CRITICAL,
                             APP_EVENT_SRC_SENSOR,
                             distance);

        last_ultra_zone = 2;
    }
    else if (distance < DIST_WARN_CM) {
        if (last_ultra_zone != 1) {
            Log_PrintNum("[SENSOR] distance=", distance, "cm, ");
            Log_PrintNum("ir=", ir, "\r\n");
            Log_Print("[POST] EVT_SENSOR_OBSTACLE_WARN\r\n");
        }

        (void)App_PostEvent(EVT_SENSOR_OBSTACLE_WARN,
                             APP_EVENT_SRC_SENSOR,
                             distance);

        last_ultra_zone = 1;
    }
    else {
        if (last_ultra_zone != 0) {
            Log_PrintNum("[SENSOR] distance=", distance, "cm, ");
            Log_PrintNum("ir=", ir, "\r\n");
            Log_Print("[POST] EVT_SENSOR_CLEAR\r\n");
        }

        (void)App_PostEvent(EVT_SENSOR_CLEAR,
                             APP_EVENT_SRC_SENSOR,
                             distance);

        last_ultra_zone = 0;
    }
}
/*
*********************************************************************************************************
*                                  JOYSTICK MANUAL COMMAND
*
* MANUAL_MODE -> joystick
*
* VRx:
*    -> LEFT
*    -> RIGHT
*
* VRy:
*    -> FORWARD
*
*   LEFT/RIGHT , center -> CENTER
*   FORWARD , center    -> STOP
*
*********************************************************************************************************
*/

typedef enum {
    JOY_DIR_CENTER = 0,
    JOY_DIR_LEFT,
    JOY_DIR_RIGHT,
    JOY_DIR_FORWARD
} JOY_DIR;

static  void  Joystick_PostManualCommand(void)
{
    uint16_t     x;
    uint16_t     y;
    JOY_DIR      now_dir;
    SystemState  state;

    static  JOY_DIR     last_dir = JOY_DIR_CENTER;
    static  JOY_DIR     candidate_dir = JOY_DIR_CENTER;
    static  CPU_INT08U  stable_count = 0u;

    x = Joystick_ReadX();
    y = Joystick_ReadY();

    g_last_joy_x = x;
    g_last_joy_y = y;


    state = App_GetState();

    if (state != STATE_MANUAL_MODE) {
        last_dir = JOY_DIR_CENTER;
        candidate_dir = JOY_DIR_CENTER;
        stable_count = 0u;
        return;
    }


    if (x < JOY_ADC_LOW_TH) {
        now_dir = JOY_DIR_LEFT;
    }
    else if (x > JOY_ADC_HIGH_TH) {
        now_dir = JOY_DIR_RIGHT;
    }
    else if (y > JOY_ADC_HIGH_TH) {
        now_dir = JOY_DIR_FORWARD;
    }
    else if (y < JOY_ADC_LOW_TH) {
        now_dir = JOY_DIR_CENTER;
    }
    else {
        candidate_dir = last_dir;
        stable_count = 0u;
        return;
    }

    if (now_dir == candidate_dir) {
        if (stable_count < JOY_STABLE_COUNT) {
            stable_count++;
        }
    }
    else {
        candidate_dir = now_dir;
        stable_count = 0u;
        return;
    }

    if (stable_count < JOY_STABLE_COUNT) {
        return;
    }

    if (now_dir == last_dir) {
        return;
    }

    if (now_dir == JOY_DIR_LEFT) {
        (void)App_PostEvent(EVT_CMD_LEFT,
            APP_EVENT_SRC_COMMAND,
            0u);

        Log_Print("[JOY] LEFT -> EVT_CMD_LEFT\r\n");
    }
    else if (now_dir == JOY_DIR_RIGHT) {
        (void)App_PostEvent(EVT_CMD_RIGHT,
            APP_EVENT_SRC_COMMAND,
            0u);

        Log_Print("[JOY] RIGHT -> EVT_CMD_RIGHT\r\n");
    }
    else if (now_dir == JOY_DIR_FORWARD) {
        (void)App_PostEvent(EVT_CMD_FORWARD,
            APP_EVENT_SRC_COMMAND,
            0u);

        Log_Print("[JOY] FORWARD -> EVT_CMD_FORWARD\r\n");
    }
    else {
        (void)App_PostEvent(EVT_CMD_CENTER,
            APP_EVENT_SRC_COMMAND,
            0u);

        Log_Print("[JOY] CENTER -> EVT_CMD_CENTER\r\n");
    }

    last_dir = now_dir;
}

/*
*********************************************************************************************************
*                                          Board skeletons
*********************************************************************************************************
*/

static  void  App_HardwareStopAll (void)
{
    /*
     * TODO(developer output/motor): Stop motors/servo immediately, then enable buzzer/LED indication.
     */
    BSP_LED_On(1u);
    BSP_LED_On(2u);
    BSP_LED_On(3u);
}

static  void  Setup_Gpio (void)
{
    GPIO_InitTypeDef  led_init;

    led_init.GPIO_Mode  = GPIO_Mode_OUT;
    led_init.GPIO_OType = GPIO_OType_PP;
    led_init.GPIO_Speed = GPIO_Speed_2MHz;
    led_init.GPIO_PuPd  = GPIO_PuPd_NOPULL;
    led_init.GPIO_Pin   = GPIO_Pin_0 | GPIO_Pin_7 | GPIO_Pin_14;

    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

    GPIO_Init(GPIOB, &led_init);
}
